zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_ME.h
#define MC_ME_PRTN2_COFB0_STAT_BLOCK23_MASK      (0x800000U)
#define MC_ME_PRTN2_COFB0_STAT_BLOCK23_SHIFT     (23U)
/*! BLOCK23 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB0_STAT_BLOCK23(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_STAT_BLOCK23_SHIFT)) & MC_ME_PRTN2_COFB0_STAT_BLOCK23_MASK)

#define MC_ME_PRTN2_COFB0_STAT_BLOCK24_MASK      (0x1000000U)
#define MC_ME_PRTN2_COFB0_STAT_BLOCK24_SHIFT     (24U)
/*! BLOCK24 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB0_STAT_BLOCK24(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_STAT_BLOCK24_SHIFT)) & MC_ME_PRTN2_COFB0_STAT_BLOCK24_MASK)

#define MC_ME_PRTN2_COFB0_STAT_BLOCK25_MASK      (0x2000000U)
#define MC_ME_PRTN2_COFB0_STAT_BLOCK25_SHIFT     (25U)
/*! BLOCK25 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB0_STAT_BLOCK25(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_STAT_BLOCK25_SHIFT)) & MC_ME_PRTN2_COFB0_STAT_BLOCK25_MASK)

#define MC_ME_PRTN2_COFB0_STAT_BLOCK27_MASK      (0x8000000U)
#define MC_ME_PRTN2_COFB0_STAT_BLOCK27_SHIFT     (27U)
/*! BLOCK27 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB0_STAT_BLOCK27(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_STAT_BLOCK27_SHIFT)) & MC_ME_PRTN2_COFB0_STAT_BLOCK27_MASK)

#define MC_ME_PRTN2_COFB0_STAT_BLOCK29_MASK      (0x20000000U)
#define MC_ME_PRTN2_COFB0_STAT_BLOCK29_SHIFT     (29U)
/*! BLOCK29 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB0_STAT_BLOCK29(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB0_STAT_BLOCK29_SHIFT)) & MC_ME_PRTN2_COFB0_STAT_BLOCK29_MASK)
/*! @} */

/*! @name PRTN2_COFB1_STAT - Partition 2 COFB Set 1 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN2_COFB1_STAT_BLOCK32_MASK      (0x1U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK32_SHIFT     (0U)
/*! BLOCK32 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK32(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK32_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK32_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK35_MASK      (0x8U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK35_SHIFT     (3U)
/*! BLOCK35 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK35(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK35_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK35_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK36_MASK      (0x10U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK36_SHIFT     (4U)
/*! BLOCK36 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK36(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK36_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK36_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK37_MASK      (0x20U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK37_SHIFT     (5U)
/*! BLOCK37 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK37(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK37_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK37_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK38_MASK      (0x40U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK38_SHIFT     (6U)
/*! BLOCK38 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK38(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK38_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK38_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK39_MASK      (0x80U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK39_SHIFT     (7U)
/*! BLOCK39 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK39(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK39_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK39_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK40_MASK      (0x100U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK40_SHIFT     (8U)
/*! BLOCK40 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK40(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK40_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK40_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK41_MASK      (0x200U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK41_SHIFT     (9U)
/*! BLOCK41 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK41(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK41_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK41_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK42_MASK      (0x400U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK42_SHIFT     (10U)
/*! BLOCK42 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK42(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK42_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK42_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK47_MASK      (0x8000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK47_SHIFT     (15U)
/*! BLOCK47 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK47(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK47_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK47_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK48_MASK      (0x10000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK48_SHIFT     (16U)
/*! BLOCK48 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK48(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK48_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK48_MASK)

#define MC_ME_PRTN2_COFB1_STAT_BLOCK51_MASK      (0x80000U)
#define MC_ME_PRTN2_COFB1_STAT_BLOCK51_SHIFT     (19U)
/*! BLOCK51 - IP block status
 *  0b0..Clock is not running.
 *  0b1..Clock is running.
 */
#define MC_ME_PRTN2_COFB1_STAT_BLOCK51(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN2_COFB1_STAT_BLOCK51_SHIFT)) & MC_ME_PRTN2_COFB1_STAT_BLOCK51_MASK)

